docs/blog/2024-08-21-metaprogramming-in-cpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Metaprogramming in Cpp</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
<header><a href="./">Home</a>
<a href="./archive.html">Archive</a>
</header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Metaprogramming in Cpp</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org030e963">1. Metaprogramming Collatz conjecture</a></li>
<li><a href="#orgea683b7">2. Metaprogramming Factorial</a></li>
<li><a href="#org24e4811">3. Metaprogramming Fibonacci</a></li>
</ul>
</div>
</div>

<div id="outline-container-org030e963" class="outline-2">
<h2 id="org030e963"><span class="section-number-2">1.</span> Metaprogramming Collatz conjecture</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-cpp">  <span style="font-weight: bold;">template</span> &lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::uint64_t, <span style="font-weight: bold; text-decoration: underline;">std</span>::uint64_t, <span style="font-weight: bold; text-decoration: underline;">std</span>::uint64_t&gt; <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">CollatzHelper</span>;

<span style="font-weight: bold;">template</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; text-decoration: underline;">A</span>, <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; text-decoration: underline;">B</span>&gt;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">CollatzHelper</span>&lt;<span style="font-weight: bold; text-decoration: underline;">A</span>,<span style="font-weight: bold; text-decoration: underline;">B</span>,1&gt;:<span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">CollatzHelper</span>&lt;(A*3+1),<span style="font-weight: bold; text-decoration: underline;">B</span>+1,((<span style="font-weight: bold; text-decoration: underline;">A</span>*3+1)%2)&gt;{};

<span style="font-weight: bold;">template</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; text-decoration: underline;">A</span>, <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; text-decoration: underline;">B</span>&gt;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">CollatzHelper</span>&lt;<span style="font-weight: bold; text-decoration: underline;">A</span>,<span style="font-weight: bold; text-decoration: underline;">B</span>,0&gt;:<span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">CollatzHelper</span>&lt;(A/2),<span style="font-weight: bold; text-decoration: underline;">B</span>+1,((<span style="font-weight: bold; text-decoration: underline;">A</span>/2)%2)&gt;{};


<span style="font-weight: bold;">template</span> &lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; text-decoration: underline;">B</span>&gt; <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">CollatzHelper</span>&lt;1,<span style="font-weight: bold; text-decoration: underline;">B</span>,1&gt;
{
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">constexpr</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; font-style: italic;">conj</span> = B;
};

<span style="font-weight: bold;">template</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; text-decoration: underline;">A</span>&gt; <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Collatz</span>: <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">CollatzHelper</span>&lt;<span style="font-weight: bold; text-decoration: underline;">A</span>,0,A%2&gt;{};
</pre>
</div>
</div>
</div>


<div id="outline-container-orgea683b7" class="outline-2">
<h2 id="orgea683b7"><span class="section-number-2">2.</span> Metaprogramming Factorial</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-cpp">  <span style="font-weight: bold;">template</span> &lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; font-style: italic;">N</span>&gt;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Fact</span>
{
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">constexpr</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; font-style: italic;">val</span> = N * <span style="font-weight: bold; text-decoration: underline;">Fact</span>&lt;N-1&gt;::val;
};

<span style="font-weight: bold;">template</span>&lt;&gt;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Fact</span>&lt;0&gt;
{
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">constexpr</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; font-style: italic;">val</span> = 1;
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org24e4811" class="outline-2">
<h2 id="org24e4811"><span class="section-number-2">3.</span> Metaprogramming Fibonacci</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-cpp">  <span style="font-weight: bold;">template</span>&lt;<span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; font-style: italic;">I</span>&gt;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Fib</span>
{
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">constexpr</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; font-style: italic;">val</span> = <span style="font-weight: bold; text-decoration: underline;">Fib</span>&lt;I-1&gt;::val + <span style="font-weight: bold; text-decoration: underline;">Fib</span>&lt;I-2&gt;::val;
};

<span style="font-weight: bold;">template</span> &lt;&gt;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Fib</span>&lt;0&gt;
{
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">constexpr</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; font-style: italic;">val</span> = 0;
};

<span style="font-weight: bold;">template</span> &lt;&gt;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Fib</span>&lt;1&gt;
{
    <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">constexpr</span> <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">uint64_t</span> <span style="font-weight: bold; font-style: italic;">val</span> = 1;
};
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
